//타입 ORM => sequlize를 사용했던 경험이 있어서 몇 가지 메소드만 익히면 사용하는 데 큰 어려움이 없었습니다.
//하지만 이번 프로젝트처럼 많은 테이블과 relation을 다루었던 건 처음이었고, 특히 cascade를 사용하는 것이 쉽지 않았습니다.
//구글링을 하고, 나와있는 코드처럼 마구잡이로 넣다가 해결할 수 있었지만, 다중 relation으로 해결하지 못한 경험도 많았습니다.

//마냥 이렇게 개발을 할 수 없기에 학습해야겠다고 생각했기에 8월 계획에 추가했습니다.

//graphql, nest.js => 둘 다 초기세팅을 학습만 했기에 이번 기회에 실제로 구현하면서 typeORM 반영해서 relation별 옵션을 함께 진행해보기 위해 학습 계획에 추가했습니다.

//그래서 현재 진행하고 있는 타입ORM, nest.js 와 graphql 순으로 학습해보겠습니다.

//하루에 아침 한시간, 저녁 한시간 학습을 하고 있어 2주씩 잡고, 진행 상황을 보고 수정해보겠습니다.

//이번 달에는 토요일마다 vscode 사용 방법에 대해서 학습할 예정입니다. 개발에 도움도 되고 편리한 것을 알았지만
//단축기나 extension에 대해서 학습해볼 생각을 하질 않았습니다.

//개발 역량을 늘리기 위해 먼저 vscode, 깃헙을 순차적으로 학습해보겠습니다.
//vscode는 학습할 게 크게 없기 때문에 주말만 학습하지만 3주에 걸쳐서 계획을 세우고 빨리 끝나면 깃헙 학습으로 넘어가겠습니다.


//=> 08/06
//  오늘 오후 일정 전에 간단하게 vscode를 재설치했습니다. 코드스테이츠를 하면서 익스텐션을 다운 받았는데, 익숙하지 않다보니 설정을 엉망으로 한 것 같아 재설치를 하고
//  유용한 익스텐션을 다운 받고 설정을 완료했습니다
//  단축키의 경우에도 학습한다고 해서 손에 익는 것이 아니기 때문에 자주 사용할 만한 단축기는 메모장에 입력을 하고 개발하면서 틈틈히 사용해볼 예정입니다.
//  이렇게 vscode는 마치고 깃헙으로 바로 넘어갈 예정입니다.

//8월

//      일   월   화   수   목   금   토
//1주       |----- 타입 ORM -----|  VSCode
//2주       |----- 타입 ORM -----|  깃
//3주       |-----  nest.js -----|  깃
//4주       |-----  nest.js -----|  깃
//5주       |-----  graphql -----|  깃

//아직은 주력인 부분을 자신있게 잘 다룬다고 확신할 수 있는 실력이 아니기 때문에 주력을 우선적으로 학습하고
//typeORM, nestjs, graphql이 끝나면 4주차에는 알고리즘이나 자료구조 등 깊이부분을 학습해보도록 하겠습니다.

//지금까지 학습했던 것은 한 폴더에 다 넣고, 주차별, 월별 폴더, 에러 헨들링 폴더를 만들어서 관리해보겠습니다.


// 공부해보기
// https://en.wikipedia.org/wiki/Performance_tuning